Docs/Reference/Content/images/dependencies/net8.0/d2/alloverit-entityframeworkcore.d2
direction: left

aoi: AllOverIt
aoi.alloverit-entityframeworkcore: AllOverIt.EntityFrameworkCore
microsoft-entityframeworkcore-relational_9-0-11: Microsoft.EntityFrameworkCore.Relational\nv9.0.11
microsoft-entityframeworkcore_9-0-11: Microsoft.EntityFrameworkCore\nv9.0.11
microsoft-extensions-caching-memory_9-0-11: Microsoft.Extensions.Caching.Memory\nv9.0.11
microsoft-extensions-configuration-abstractions_9-0-11: Microsoft.Extensions.Configuration.Abstractions\nv9.0.11
microsoft-extensions-logging_9-0-11: Microsoft.Extensions.Logging\nv9.0.11
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
microsoft-entityframeworkcore-relational_9-0-11 <- aoi.alloverit-entityframeworkcore
microsoft-entityframeworkcore_9-0-11 <- microsoft-entityframeworkcore-relational_9-0-11
microsoft-extensions-caching-memory_9-0-11 <- microsoft-entityframeworkcore-relational_9-0-11
microsoft-extensions-configuration-abstractions_9-0-11 <- microsoft-entityframeworkcore-relational_9-0-11
microsoft-extensions-logging_9-0-11 <- microsoft-entityframeworkcore-relational_9-0-11
aoi.alloverit <- aoi.alloverit-entityframeworkcore
aoi.alloverit-assertion <- aoi.alloverit
microsoft-entityframeworkcore-relational_9-0-11.style.fill: "#ADD8E6"
microsoft-entityframeworkcore-relational_9-0-11.style.opacity: 0.8
microsoft-entityframeworkcore_9-0-11.style.fill: "#FFEC96"
microsoft-entityframeworkcore_9-0-11.style.opacity: 0.8
microsoft-extensions-caching-memory_9-0-11.style.fill: "#FFEC96"
microsoft-extensions-caching-memory_9-0-11.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_9-0-11.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_9-0-11.style.opacity: 0.8
microsoft-extensions-logging_9-0-11.style.fill: "#FFEC96"
microsoft-extensions-logging_9-0-11.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
